In [ ]:
# 5.3 基本数据操作

In [1]:
import pandas as pd
# 读取文件
data = pd.read_csv("./stock_day.csv")

# 删除一些列，让数据更简单些，再去做后面的操作
data = data.drop(["ma5","ma10","ma20","v_ma5","v_ma10","v_ma20"],axis=1)

# 索引操作

Numpy当中我们已经讲过使用索引选取序列和切片选择，pandas也支持类似的操作，也可以直接使用列名、行名称，甚至组合使用。
## 直接使用行列索引(先列后行)

获取'2018-02-27'这天的'close'的结果

In [4]:
# 直接使用行列索引名字的方式（先列后行）
data['open']['2018-02-27']

23.53

In [ ]:
# 不支持的操作
# 错误
data['2018-02-27']['open']
# 错误
data[:1, :2]

## 结合loc或者iloc使用索引

获取从'2018-02-27':'2018-02-22'，'open'的结果

In [5]:
# 使用loc:只能指定行列索引的名字
data.loc['2018-02-27':'2018-02-22','open']

2018-02-27    23.53
2018-02-26    22.80
2018-02-23    22.88
2018-02-22    22.25
Name: open, dtype: float64

In [6]:
# 使用iloc可以通过索引的下标去获取
# 获取前3天数据,前5列的结果
data.iloc[:3,:5]

             open   high  close    low    volume
2018-02-27  23.53  25.88  24.16  23.53  95578.03
2018-02-26  22.80  23.78  23.53  22.80  60985.11
2018-02-23  22.88  23.37  22.82  22.71  52914.01

## 使用ix组合索引
获取行第1天到第4天，['open', 'close', 'high', 'low']这个四个指标的结果

In [8]:
# 使用ix进行下表和名称组合做引
# Warning:Starting in 0.20.0, the .ix indexer is deprecated,
# in favor of the more strict .iloc and .loc indexers.
data.ix[0:4,['open', 'close', 'high', 'low']]

             open  close   high    low
2018-02-27  23.53  24.16  25.88  23.53
2018-02-26  22.80  23.53  23.78  22.80
2018-02-23  22.88  22.82  23.37  22.71
2018-02-22  22.25  22.28  22.76  22.02

In [9]:
# 推荐使用loc和iloc来获取的方式
data.loc[data.index[0:4],['open', 'close', 'high', 'low']]

             open  close   high    low
2018-02-27  23.53  24.16  25.88  23.53
2018-02-26  22.80  23.53  23.78  22.80
2018-02-23  22.88  22.82  23.37  22.71
2018-02-22  22.25  22.28  22.76  22.02

In [10]:
data.iloc[0:4,data.columns.get_indexer(['open', 'close', 'high', 'low'])]

             open  close   high    low
2018-02-27  23.53  24.16  25.88  23.53
2018-02-26  22.80  23.53  23.78  22.80
2018-02-23  22.88  22.82  23.37  22.71
2018-02-22  22.25  22.28  22.76  22.02

# 赋值操作

对DataFrame当中的close列进行重新赋值为1

In [11]:
data.close

2018-02-27    24.16
2018-02-26    23.53
2018-02-23    22.82
2018-02-22    22.28
2018-02-14    21.92
2018-02-13    21.48
2018-02-12    21.19
2018-02-09    20.36
2018-02-08    21.88
2018-02-07    21.80
2018-02-06    22.29
2018-02-05    23.27
2018-02-02    22.62
2018-02-01    22.42
2018-01-31    23.72
2018-01-30    23.83
2018-01-29    23.77
2018-01-26    24.49
2018-01-25    24.37
2018-01-24    25.29
2018-01-23    25.50
2018-01-22    25.13
2018-01-19    25.13
2018-01-18    24.60
2018-01-17    24.60
2018-01-16    24.40
2018-01-15    23.43
2018-01-12    24.24
2018-01-11    23.67
2018-01-10    23.80
              ...
2015-04-13    21.13
2015-04-10    19.43
2015-04-09    19.62
2015-04-08    18.42
2015-04-07    17.54
2015-04-03    16.66
2015-04-02    16.44
2015-04-01    16.29
2015-03-31    16.17
2015-03-30    16.42
2015-03-27    15.77
2015-03-26    14.93
2015-03-25    15.30
2015-03-24    15.68
2015-03-23    15.38
2015-03-20    15.34
2015-03-19    15.38
2015-03-18    15.31
2015-03-17    15.18
2015-03-16    14.87
2015-03-13    14.47
2015-03-12    14.11
2015-03-11    14.30
2015-03-10    14.65
2015-03-09    14.31
2015-03-06    14.28
2015-03-05    13.16
2015-03-04    12.90
2015-03-03    12.70
2015-03-02    12.52
Name: close, Length: 643, dtype: float64

In [12]:
# 直接修改原来的值
data['close'] = 1
# 或者
data.close = 1

In [13]:
data['close']

2018-02-27    1
2018-02-26    1
2018-02-23    1
2018-02-22    1
2018-02-14    1
2018-02-13    1
2018-02-12    1
2018-02-09    1
2018-02-08    1
2018-02-07    1
2018-02-06    1
2018-02-05    1
2018-02-02    1
2018-02-01    1
2018-01-31    1
2018-01-30    1
2018-01-29    1
2018-01-26    1
2018-01-25    1
2018-01-24    1
2018-01-23    1
2018-01-22    1
2018-01-19    1
2018-01-18    1
2018-01-17    1
2018-01-16    1
2018-01-15    1
2018-01-12    1
2018-01-11    1
2018-01-10    1
             ..
2015-04-13    1
2015-04-10    1
2015-04-09    1
2015-04-08    1
2015-04-07    1
2015-04-03    1
2015-04-02    1
2015-04-01    1
2015-03-31    1
2015-03-30    1
2015-03-27    1
2015-03-26    1
2015-03-25    1
2015-03-24    1
2015-03-23    1
2015-03-20    1
2015-03-19    1
2015-03-18    1
2015-03-17    1
2015-03-16    1
2015-03-13    1
2015-03-12    1
2015-03-11    1
2015-03-10    1
2015-03-09    1
2015-03-06    1
2015-03-05    1
2015-03-04    1
2015-03-03    1
2015-03-02    1
Name: close, Length: 643, dtype: int64

# 排序
排序有两种形式，一种对于索引进行排序，一种对于内容进行排序
## DataFrame排序
- 使用df.sort_values(by=, ascending=)
- 
    - 单个键或者多个键进行排序,
    - 参数：
        - by：指定排序参考的键
        - ascending:默认升序
            - ascending=False:降序
            - ascending=True:升序

In [2]:
# 按照开盘价大小进行排序 , 使用ascending指定按照大小排序
data.sort_values(by="open", ascending=True).head()

,open,high,close,low,volume,price_change,p_change,turnover
2015-03-02,12.25,12.67,12.52,12.20,96291.73,0.32,2.62,3.30
2015-09-02,12.30,14.11,12.36,12.30,70201.74,-1.10,-8.17,2.40
2015-03-03,12.52,13.06,12.70,12.52,139071.61,0.18,1.44,4.76
2015-03-04,12.80,12.92,12.90,12.61,67075.44,0.20,1.57,2.30
2015-03-05,12.88,13.45,13.16,12.87,93180.39,0.26,2.02,3.19

In [4]:
# 按照多个键进行排序
data.sort_values(by=['open', 'high']).head()

,open,high,close,low,volume,price_change,p_change,turnover
2015-03-02,12.25,12.67,12.52,12.20,96291.73,0.32,2.62,3.30
2015-09-02,12.30,14.11,12.36,12.30,70201.74,-1.10,-8.17,2.40
2015-03-03,12.52,13.06,12.70,12.52,139071.61,0.18,1.44,4.76
2015-03-04,12.80,12.92,12.90,12.61,67075.44,0.20,1.57,2.30
2015-03-05,12.88,13.45,13.16,12.87,93180.39,0.26,2.02,3.19

In [6]:
# 对索引进行排序
data.sort_index().head()

,open,high,close,low,volume,price_change,p_change,turnover
2015-03-02,12.25,12.67,12.52,12.20,96291.73,0.32,2.62,3.30
2015-03-03,12.52,13.06,12.70,12.52,139071.61,0.18,1.44,4.76
2015-03-04,12.80,12.92,12.90,12.61,67075.44,0.20,1.57,2.30
2015-03-05,12.88,13.45,13.16,12.87,93180.39,0.26,2.02,3.19
2015-03-06,13.17,14.48,14.28,13.13,179831.72,1.12,8.51,6.16

## Series排序

- 使用series.sort_values(ascending=True)进行排序

series排序时，只有一列，不需要参数

In [7]:
data['p_change'].sort_values(ascending=True).head()

2015-09-01   -10.03
2015-09-14   -10.02
2016-01-11   -10.02
2015-07-15   -10.02
2015-08-26   -10.01
Name: p_change, dtype: float64

- 使用series.sort_index()进行排序

与df一致

In [8]:
data['p_change'].sort_index().head()

2015-03-02    2.62
2015-03-03    1.44
2015-03-04    1.57
2015-03-05    2.02
2015-03-06    8.51
Name: p_change, dtype: float64

# 总结
- 1.索引【掌握】
    - 直接索引 -- 先列后行,是需要通过索引的字符串进行获取
    - loc -- 先行后列,是需要通过索引的字符串进行获取
    - iloc -- 先行后列,是通过下标进行索引
    - ix -- 先行后列, 可以用上面两种方法混合进行索引
- 2.赋值【知道】
    - data[""] = **
    - data. =
- 3.排序【知道】
    - dataframe
        - 对象.sort_values()
        - 对象.sort_index()
    - series
        - 对象.sort_values()
        - 对象.sort_index()